## Data

In [25]:
import pandas as pd

In [28]:
students = {
    'name': ['Finley', 'Andrew', 'Blake', "Denis"],
    'last_name': ['Brown', 'Bradley', 'Hughes', "James"],
    'age': [23, 21, 34,24],
    "student_number":[101, 403, 202,1]
    

}

In [29]:
student_df = pd.DataFrame(students)

## Satır Ekleme

In [30]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [31]:
student_df.append({"name":"Ben", "age":23}, ignore_index=True) #append pandasın son sürümünden kaldırıldı.

AttributeError: 'DataFrame' object has no attribute 'append'

In [32]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [33]:
student_df = student_df.append({"name":"Ben"}, ignore_index=True)

AttributeError: 'DataFrame' object has no attribute 'append'

In [34]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

## İki  DataFrame'i Birleştirmek

In [36]:
students = {
    'name': ['Finley', 'Andrew', 'Blake'],
    'last_name': ['Brown', 'Brown', 'Hughes'],
    'age': [23, 21, 34],
    'student_number': [101, 403, 202]
}

df = pd.DataFrame(students)

In [37]:
students_2 = {
    'name': ['Charlie', 'Loui', 'Donra'],
    'last_name': ['Brown', 'Black', 'High'],
    'age': [8, 21, 34],
    'student_number': [201, 404, 502],
    'student_number2': [1201, 1404, 1502]
}

In [38]:
df2 = pd.DataFrame(students_2)

In [39]:
df2

      name last_name  age  student_number  student_number2
0  Charlie     Brown    8             201             1201
1     Loui     Black   21             404             1404
2    Donra      High   34             502             1502

In [40]:
df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew     Brown   21             403
2   Blake    Hughes   34             202

In [41]:
df3 = df.append(df2, sort=False)

AttributeError: 'DataFrame' object has no attribute 'append'

In [42]:
df3

NameError: name 'df3' is not defined

In [43]:
df3.loc[2]

NameError: name 'df3' is not defined

In [45]:
df3 = df.append(df2, ignore_index=True, sort=False)

AttributeError: 'DataFrame' object has no attribute 'append'

In [46]:
df3

NameError: name 'df3' is not defined

## Satırları Silmek

In [47]:
df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew     Brown   21             403
2   Blake    Hughes   34             202

In [64]:
df.drop(index=2)

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew     Brown   21             403

In [65]:
df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew     Brown   21             403
2   Blake    Hughes   34             202

In [66]:
df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew     Brown   21             403
2   Blake    Hughes   34             202

In [67]:
filt = (df["age"] < 24)

In [49]:
filt

0     True
1     True
2    False
Name: age, dtype: bool

In [50]:
df[filt]

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew     Brown   21             403

In [51]:
df[filt].index

Index([0, 1], dtype='int64')

In [52]:
df.drop(index=df[filt].index)

    name last_name  age  student_number
2  Blake    Hughes   34             202

In [54]:
df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew     Brown   21             403
2   Blake    Hughes   34             202